# IsCuttable Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Category..::..IsCuttable Property
Category Class See Also
---
Indicates if the category is cuttable or not.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool IsCuttable { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsCuttable As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsCuttable {
	bool get ();
}
```

# See Also
Category Class
Autodesk.Revit.DB Namespace